In [29]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [35]:
ty_2016 =pd.read_csv('total_youth_2016.csv')
ty_2017=pd.read_csv('total_youth_2017.csv')
oy_2016=pd.read_csv('opportunity_youth_2016.csv')
oy_2017=pd.read_csv('opportunity_youth_2017.csv')

In [31]:
ty_2016

,Unnamed: 0,%16-18,16-18,%19-21,19-21,%22-24,22-24,%Total,Total
0,Total,100.000000,50053.0,100.000000,41651.0,100.000000,48031.0,100.000000,139735.0
1,Opportunity Youth,5.604060,2805.0,17.488176,7284.0,18.171598,8728.0,13.466204,18817.0
2,Working Without Diploma,1.172757,587.0,4.919450,2049.0,5.989882,2877.0,3.945325,5513.0
3,Not Youth Opportunity,93.223183,46661.0,77.592375,32318.0,75.838521,36426.0,82.588471,115405.0

In [32]:
oy_2017

,educationattainment,%16-18,16-18,%19-21,19-21,%22-24,22-24,%Total,Total
0,Total,100.000000,1815,100.000000,3902,100.000000,4897,100.000000,10614.0
1,No Diploma,50.468320,916,28.498206,1112,27.547478,1349,31.816469,3377.0
2,HS Diploma or GED,43.030303,781,55.766274,2176,43.598121,2135,47.974373,5092.0
3,"Some College, No Degree",6.501377,118,13.352127,521,20.420666,1000,15.441869,1639.0
4,Degree (Associate or Higher),0.000000,0,2.383393,93,8.433735,413,4.767288,506.0

In [33]:
oy_2016

,Unnamed: 0,%16-18,16-18,%19-21,19-21,%22-24,22-24,%Total,Total
0,Total,100.000000,2805.0,100.000000,7284.0,100.000000,8728.0,100.000000,18817.0
1,No Diploma,57.397504,1610.0,28.116420,2048.0,22.697067,1981.0,29.967583,5639.0
2,HS Diploma or GED,35.115865,985.0,45.977485,3349.0,35.139780,3067.0,39.331456,7401.0
3,"Some College, No Degree",6.381462,179.0,22.872048,1666.0,20.199358,1763.0,19.174151,3608.0
4,Degree (Associate or Higher),1.105169,31.0,3.034047,221.0,21.963795,1917.0,11.526811,2169.0

In [34]:
ty_2016

,Unnamed: 0,%16-18,16-18,%19-21,19-21,%22-24,22-24,%Total,Total
0,Total,100.000000,50053.0,100.000000,41651.0,100.000000,48031.0,100.000000,139735.0
1,Opportunity Youth,5.604060,2805.0,17.488176,7284.0,18.171598,8728.0,13.466204,18817.0
2,Working Without Diploma,1.172757,587.0,4.919450,2049.0,5.989882,2877.0,3.945325,5513.0
3,Not Youth Opportunity,93.223183,46661.0,77.592375,32318.0,75.838521,36426.0,82.588471,115405.0